esbenp.prettier-vscode
foxundermoon.shell-format
github.copilot
github.copilot-chat
gitlab.gitlab-workflow
golang.go
grafana.grafana-alloy
grafana.vscode-jsonnet
hashicorp.hcl
hashicorp.terraform
hsnazar.hyper-term-theme
jkillian.custom-local-formatters
mads-hartmann.bash-ide-vscode
mineiros.terramate
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
pkief.material-icon-theme
signageos.signageos-vscode-sops
tamasfe.even-better-toml
veracosta.mib